/*
 Navicat Premium Data Transfer

 Source Server         : Mysql
 Source Server Type    : MySQL
 Source Server Version : 80034
 Source Host           : localhost:3306
 Source Schema         : demo

 Target Server Type    : MySQL
 Target Server Version : 80034
 File Encoding         : 65001

 Date: 27/12/2023 10:40:08
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for departments
-- ----------------------------
DROP TABLE IF EXISTS `departments`;
CREATE TABLE `departments`  (
  `department_id` int NOT NULL,
  `department_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `department_type` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `department_desc` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`department_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of departments
-- ----------------------------
INSERT INTO `departments` VALUES (101, '行政部门', '行政管理类', '负责医疗管理系统的日常行政事务，包括人员招聘、员工培训、会议组织、行政文件管理等。', '2023-11-30 12:00:00', '2023-12-01 23:49:36');
INSERT INTO `departments` VALUES (102, '安全部门', '行政管理类', '负责医院安全和保卫工作，包括安全巡查、门禁管理、突发事件应急处理等。', '2023-11-30 12:00:00', '2023-12-01 23:49:40');
INSERT INTO `departments` VALUES (103, '财务部门', '行政管理类', '负责医院财务管理，包括预算编制、费用核算、财务报表分析、资金管理等。', '2023-11-30 12:00:00', '2023-12-01 23:49:43');
INSERT INTO `departments` VALUES (104, '法务部门', '行政管理类', '负责处理医院法律事务，包括合规性审核、法律咨询、合同管理、纠纷解决等。', '2023-11-30 12:00:00', '2023-12-01 23:49:45');
INSERT INTO `departments` VALUES (105, '人力资源部门', '行政管理类', '负责医院人力资源管理，包括招聘、培训、绩效考核、员工福利管理等。', '2023-11-30 12:00:00', '2023-12-01 23:49:47');
INSERT INTO `departments` VALUES (201, '医务部门', '医疗服务类', '负责医院的医疗服务管理，包括医生排班、病历管理、医疗质量评估、医疗流程优化等。', '2023-11-30 12:00:00', '2023-12-01 23:49:49');
INSERT INTO `departments` VALUES (202, '护理部门', '医疗服务类', '负责护理服务的管理，包括护士排班、护理记录、护理质量控制、患者护理计划等。', '2023-11-30 12:00:00', '2023-12-01 23:49:51');
INSERT INTO `departments` VALUES (301, '采购部门', '后勤保障类', '负责医院物资和设备的采购工作，包括供应商选择、采购合同管理、库存控制等。', '2023-11-30 12:00:00', '2023-12-01 23:49:54');
INSERT INTO `departments` VALUES (302, '卫生部门', '后勤保障类', '负责医院卫生环境管理，包括清洁消毒、垃圾处理、传染病防控等。', '2023-11-30 12:00:00', '2023-12-01 23:49:56');
INSERT INTO `departments` VALUES (303, '饮食部门', '后勤保障类', '负责医院饮食服务管理，包括餐饮计划制定、食材采购、餐饮质量控制等。', '2023-11-30 12:00:00', '2023-12-01 23:49:58');
INSERT INTO `departments` VALUES (304, '能源部门', '后勤保障类', '负责医院能源管理，包括水电供应、能源消耗监控、能源节约措施等。', '2023-11-30 12:00:00', '2023-12-01 23:50:00');
INSERT INTO `departments` VALUES (401, '建筑部门', '设施维护类', '负责医院建筑设施管理，包括维护保养、改造工程、环境设施规划等。', '2023-11-30 12:00:00', '2023-12-01 23:50:03');
INSERT INTO `departments` VALUES (402, '设备维护部门', '设施维护类', '负责医疗设备的维修、保养和管理工作，确保设备正常运行。', '2023-11-30 12:00:00', '2023-12-01 23:50:05');
INSERT INTO `departments` VALUES (501, '信息技术部门', '技术支持类', '负责医疗信息系统的开发、维护和管理，包括电子病历系统、医院管理系统等的实施与支持。', '2023-11-30 12:00:00', '2023-12-01 23:50:07');

-- ----------------------------
-- Table structure for doctors
-- ----------------------------
DROP TABLE IF EXISTS `doctors`;
CREATE TABLE `doctors`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `doctor_id` int NULL DEFAULT NULL,
  `doctor_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `gender` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `age` int NULL DEFAULT NULL,
  `phone_number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `specialty` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `schedule_info` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `doctors_ibfk_1`(`doctor_id`) USING BTREE,
  INDEX `doctors_ibfk_2`(`doctor_name`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 206 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of doctors
-- ----------------------------
INSERT INTO `doctors` VALUES (1, 20120001, '赵宇', '男', 35, '13578901234', '助理医师', '急诊科', '周一', '2023-12-01 23:53:32', '2023-12-20 22:09:32');
INSERT INTO `doctors` VALUES (2, 20120002, '刘鹏', '男', 44, '13612345678', '助理医师', '社区卫生科', '周一', '2023-12-01 23:53:32', '2023-12-20 21:46:12');
INSERT INTO `doctors` VALUES (3, 20120003, '周雪', '女', 46, '13798765432', '助理医师', '社区卫生科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (4, 20120004, '马婷', '女', 33, '13856789012', '助理医师', '慢病科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (5, 20120005, '姚晨', '女', 36, '13987654321', '助理医师', '慢病科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (6, 20120006, '李杰', '男', 57, '15098765432', '助理医师', '疼痛科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (7, 20120007, '王娜', '女', 59, '15123456789', '助理医师', '心理咨询科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (8, 20120008, '杨娜', '女', 37, '15234567890', '助理医师', '皮肤美容科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (9, 20120009, '赵强', '男', 30, '15367890123', '助理医师', '内科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (10, 20120010, '陈娜', '女', 31, '15509876543', '助理医师', '外科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (11, 20120011, '韩兵', '男', 36, '15678901234', '助理医师', '心血管内科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (12, 20120012, '王梅', '女', 30, '15789012345', '助理医师', '消化内科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (13, 20120013, '高磊', '男', 57, '15890123456', '助理医师', '血液内科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (14, 20120014, '李晨', '男', 29, '15901234567', '助理医师', '肾内科', '周一', '2023-12-01 23:53:32', '2023-12-20 18:39:43');
INSERT INTO `doctors` VALUES (15, 20120015, '赵梓', '女', 46, '17023456789', '助理医师', '呼吸内科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (16, 20120016, '李娜', '女', 33, '17134567890', '助理医师', '风湿免疫科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (17, 20120017, '刘晨', '女', 37, '17245678901', '助理医师', '风湿免疫科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (18, 20120018, '周娜', '女', 59, '17356789012', '助理医师', '儿科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (19, 20120019, '王洁', '女', 45, '17467890123', '助理医师', '妇产科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (20, 20120020, '王阳', '男', 53, '17578901234', '助理医师', '男科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (21, 20120021, '周娟', '女', 34, '17689012345', '助理医师', '男科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (22, 20120022, '赵晓', '女', 60, '17790123456', '助理医师', '眼科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (23, 20120023, '刘婷', '女', 57, '17801234567', '助理医师', '口腔科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (24, 20120024, '王萍', '女', 36, '17912345678', '助理医师', '皮肤科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (25, 20120025, '王风', '男', 54, '18023456789', '助理医师', '精神科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (26, 20120026, '刘洁', '女', 35, '18134567890', '助理医师', '精神科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (27, 20120027, '陈晓丽', '女', 57, '18245678901', '助理医师', '感染科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (28, 20120028, '陈梅', '女', 34, '18356789012', '助理医师', '中医科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (29, 20120029, '刘静', '女', 59, '18467890123', '助理医师', '肝病科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (30, 20120030, '刘丽', '女', 33, '18578901234', '助理医师', '心胸外科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (31, 20120031, '杨丹', '女', 35, '18689012345', '助理医师', '神经外科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (32, 20120032, '张霞', '女', 38, '18790123456', '助理医师', '泌尿外科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (33, 20120033, '周萍', '女', 39, '18801234567', '助理医师', '整形外科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (34, 20120034, '李霞', '女', 39, '18912345678', '助理医师', '病理科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (35, 20120035, '周琳', '女', 40, '19023456789', '助理医师', '康复医学科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (36, 20120036, '张梅', '女', 40, '19134567890', '助理医师', '放射科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (37, 20120037, '周华', '女', 41, '19245678901', '助理医师', '肿瘤科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (38, 20120038, '张琳', '女', 41, '19356789012', '助理医师', '骨科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (39, 20120039, '周勇', '男', 47, '19467890123', '助理医师', '骨科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (40, 20120040, '张华', '女', 41, '19578901234', '助理医师', '影像科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (41, 20120041, '周杰', '男', 48, '19689012345', '助理医师', '影像科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (42, 20120042, '陈明', '男', 42, '19790123456', '助理医师', '医学美容科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (43, 20120043, '王霞', '女', 43, '19801234567', '助理医师', '老年病科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (44, 20120044, '刘杰', '男', 44, '19912345678', '助理医师', '性病科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (45, 20120045, '李明', '男', 47, '13023456789', '助理医师', '性病科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (46, 20130001, '陈梦', '女', 42, '13134567890', '主治医师', '急诊科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (47, 20130002, '王璐', '女', 38, '13245678901', '主治医师', '急诊科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (48, 20130003, '朱浩', '男', 55, '13356789012', '主治医师', '社区卫生科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (49, 20130004, '孙泽', '男', 58, '13467890123', '主治医师', '社区卫生科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (50, 20130005, '魏冰', '女', 53, '16678901234', '主治医师', '慢病科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (51, 20130006, '杨林', '男', 45, '13578901234', '主治医师', '心理咨询科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (52, 20130007, '陈涛', '男', 32, '13612345678', '主治医师', '疼痛科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (53, 20130008, '王晨', '女', 39, '13798765432', '主治医师', '疼痛科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (54, 20130009, '赵莉', '女', 47, '13856789012', '主治医师', '心理咨询科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (55, 20130010, '张飞', '男', 52, '13987654321', '主治医师', '心理咨询科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (56, 20130011, '李雨', '女', 40, '15098765432', '主治医师', '皮肤美容科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (57, 20130012, '张峰', '男', 54, '15123456789', '主治医师', '皮肤美容科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (58, 20130013, '徐丽', '女', 48, '15234567890', '主治医师', '内科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (59, 20130014, '王露', '女', 41, '15367890123', '主治医师', '内科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (60, 20130015, '刘明', '男', 43, '15509876543', '主治医师', '内科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (61, 20130016, '李云', '女', 55, '15678901234', '主治医师', '外科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (62, 20130017, '周平', '男', 50, '15789012345', '主治医师', '外科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (63, 20130018, '刘静', '女', 59, '15890123456', '主治医师', '心血管内科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (64, 20130019, '王志', '男', 34, '15901234567', '主治医师', '心血管内科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (65, 20130020, '赵平', '男', 37, '17023456789', '主治医师', '心血管内科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (66, 20130021, '周华', '女', 53, '17134567890', '主治医师', '消化内科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (67, 20130022, '李龙', '男', 48, '17245678901', '主治医师', '消化内科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (68, 20130023, '刘宇', '男', 44, '17356789012', '主治医师', '血液内科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (69, 20130024, '陈杰', '男', 39, '17467890123', '主治医师', '血液内科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (70, 20130025, '孙鹏', '男', 33, '17578901234', '主治医师', '血液内科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (71, 20130026, '张琦', '女', 38, '17689012345', '主治医师', '肾内科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (72, 20130027, '刘阳', '男', 39, '17790123456', '主治医师', '肾内科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (73, 20130028, '孙伟', '男', 55, '17801234567', '主治医师', '呼吸内科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (74, 20130030, '张磊', '男', 42, '17912345678', '主治医师', '呼吸内科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (75, 20130031, '李飞', '男', 51, '18023456789', '主治医师', '风湿免疫科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (76, 20130032, '韩娜', '女', 42, '18134567890', '主治医师', '风湿免疫科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (77, 20130033, '程涛', '男', 32, '18245678901', '主治医师', '内分泌科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (78, 20130034, '朱晨', '女', 35, '18356789012', '主治医师', '内分泌科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (79, 20130035, '张莉', '女', 49, '18467890123', '主治医师', '内分泌科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (80, 20130036, '刘飞', '男', 44, '18578901234', '主治医师', '儿科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (81, 20130037, '王琳', '女', 41, '18689012345', '主治医师', '儿科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (82, 20130038, '张鹏', '男', 39, '18790123456', '主治医师', '妇产科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (83, 20130039, '李峰', '男', 47, '18801234567', '主治医师', '妇产科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (84, 20130040, '张丽', '女', 36, '18912345678', '主治医师', '男科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (85, 20130041, '赵磊', '男', 38, '19023456789', '主治医师', '男科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (86, 20130042, '李娟', '女', 55, '19134567890', '主治医师', '眼科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (87, 20130043, '张浩', '男', 41, '19245678901', '主治医师', '眼科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (88, 20130044, '李梅', '女', 32, '19356789012', '主治医师', '耳鼻喉科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (89, 20130045, '陈涛', '男', 35, '19467890123', '主治医师', '耳鼻喉科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (90, 20130046, '王晨', '男', 33, '19578901234', '主治医师', '口腔科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (91, 20130047, '陈飞', '男', 40, '19689012345', '主治医师', '口腔科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (92, 20130048, '张杰', '男', 42, '19790123456', '主治医师', '口腔科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (93, 20130049, '陈峰', '男', 46, '19801234567', '主治医师', '皮肤科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (94, 20130050, '张丹', '女', 33, '19912345678', '主治医师', '皮肤科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (95, 20130051, '赵涛', '男', 37, '13856789012', '主治医师', '精神科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (96, 20130052, '张晓琳', '女', 43, '13789012345', '主治医师', '感染科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (97, 20130053, '王浩', '男', 39, '13901234567', '主治医师', '感染科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (98, 20130054, '张峰', '男', 32, '13678901234', '主治医师', '中医科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (99, 20130055, '杨浩', '男', 44, '13567890123', '主治医师', '中医科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (100, 20130056, '李婷', '女', 56, '13456789012', '主治医师', '肝病科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (101, 20130057, '赵翔', '男', 41, '13612345678', '主治医师', '肝病科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (102, 20130058, '王涛', '男', 31, '13923456789', '主治医师', '心胸外科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (103, 20130059, '赵浩', '男', 40, '15834567890', '主治医师', '心胸外科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (104, 20130060, '张梅', '女', 42, '15045678901', '主治医师', '神经外科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (105, 20130061, '王磊', '男', 37, '13756789012', '主治医师', '神经外科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (106, 20130062, '王伟', '男', 52, '15967890123', '主治医师', '泌尿外科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (107, 20130063, '孙强', '男', 55, '18378901234', '主治医师', '泌尿外科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (108, 20130064, '陈良', '男', 53, '13589012345', '主治医师', '整形外科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (109, 20130065, '王俊', '男', 51, '18190123456', '主治医师', '病理科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (110, 20130066, '孙华', '男', 56, '15301234567', '主治医师', '病理科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (111, 20130067, '陈敏', '女', 38, '18712345678', '主治医师', '康复医学科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (112, 20130068, '李杰', '男', 50, '13923456789', '主治医师', '放射科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (113, 20130069, '孙丹', '女', 57, '15234567890', '主治医师', '放射科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (114, 20130070, '陈勇', '男', 50, '13445678901', '主治医师', '肿瘤科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (115, 20130071, '李华', '男', 49, '18156789012', '主治医师', '肿瘤科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (116, 20130072, '孙杰', '男', 58, '15067890123', '主治医师', '骨科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (117, 20130073, '陈琳', '女', 39, '18878901234', '主治医师', '牙科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (118, 20130074, '李丹', '女', 45, '15989012345', '主治医师', '牙科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (119, 20130075, '孙平', '男', 59, '13690123456', '主治医师', '影像科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (120, 20130076, '陈强', '男', 51, '18201234567', '主治医师', '医学美容科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (121, 20130077, '杨军', '男', 47, '15712345678', '主治医师', '老年病科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (122, 20130078, '杜伟', '男', 51, '13923456789', '主治医师', '老年病科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (123, 20130079, '陈萍', '女', 49, '15634567890', '主治医师', '性病科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (124, 20140001, '张阳', '男', 50, '15845678901', '副主任医师', '急诊科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (125, 20140002, '高伟', '男', 49, '15056789012', '副主任医师', '慢病科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (126, 20140003, '刘芳', '女', 51, '18367890123', '副主任医师', '疼痛科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (127, 20140004, '刘冬', '男', 56, '17878901234', '副主任医师', '皮肤美容科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (128, 20140005, '张禹', '男', 47, '13589012345', '副主任医师', '外科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (129, 20140006, '张洋', '女', 45, '15190123456', '副主任医师', '消化内科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (130, 20140007, '王斌', '男', 43, '15501234567', '副主任医师', '肾内科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (131, 20140008, '宋雪', '女', 50, '18712345678', '副主任医师', '呼吸内科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (132, 20140009, '吴芳', '女', 47, '13923456789', '副主任医师', '内分泌科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (133, 20140010, '杨静', '女', 56, '18934567890', '副主任医师', '儿科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (134, 20140011, '陈晨', '女', 31, '13645678901', '副主任医师', '妇产科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (135, 20140012, '刘磊', '男', 37, '18056789012', '副主任医师', '眼科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (136, 20140013, '孙静', '女', 48, '15967890123', '副主任医师', '耳鼻喉科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (137, 20140014, '张婷', '女', 46, '18278901234', '副主任医师', '耳鼻喉科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (138, 20140015, '杨静', '女', 29, '13689012345', '副主任医师', '皮肤科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (139, 20140016, '杨飞', '男', 50, '18590123456', '副主任医师', '精神科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (140, 20140017, '李萍', '女', 48, '15601234567', '副主任医师', '感染科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (141, 20140018, '王涛', '男', 38, '18712345678', '副主任医师', '中医科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (142, 20140019, '张雪', '女', 47, '13923456789', '副主任医师', '肝病科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (143, 20140020, '李磊', '男', 58, '15234567890', '副主任医师', '心胸外科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (144, 20140021, '刘娟', '女', 45, '13445678901', '副主任医师', '神经外科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (145, 20140022, '赵丽', '女', 42, '18156789012', '副主任医师', '泌尿外科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (146, 20140023, '朱敏', '女', 41, '15067890123', '副主任医师', '整形外科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (147, 20140024, '张娟', '女', 48, '18878901234', '副主任医师', '整形外科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (148, 20140025, '赵丹', '女', 43, '15989012345', '副主任医师', '病理科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (149, 20140026, '朱勇', '男', 54, '13690123456', '副主任医师', '康复医学科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (150, 20140027, '王平', '女', 47, '18201234567', '副主任医师', '康复医学科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (151, 20140028, '赵勇', '男', 44, '13712345678', '副主任医师', '放射科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (152, 20140029, '朱强', '男', 55, '13923456789', '副主任医师', '康复医学科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (153, 20140030, '王丹', '女', 46, '15834567890', '副主任医师', '肿瘤科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (154, 20140031, '赵平', '女', 44, '15045678901', '副主任医师', '骨科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (155, 20140032, '朱华', '女', 42, '13756789012', '副主任医师', '牙科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (156, 20140033, '王强', '男', 52, '15967890123', '副主任医师', '牙科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (157, 20140034, '赵强', '男', 45, '18378901234', '副主任医师', '影像科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (158, 20140035, '朱琳', '女', 43, '13589012345', '副主任医师', '医学美容科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (159, 20140036, '王娟', '女', 39, '18190123456', '副主任医师', '医学美容科', '周三', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (160, 20140037, '张勇', '男', 46, '15301234567', '副主任医师', '老年病科', '周二', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (161, 20140038, '赵敏', '女', 38, '18712345678', '副主任医师', '性病科', '周一', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (162, 20140039, '王艳', '女', 41, '13923456789', '副主任医师', '性病科', '周四', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (163, 20150001, '李秋', '女', 31, '15234567890', '主任医师', '急诊科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (164, 20150002, '周琳', '女', 60, '13445678901', '主任医师', '社区卫生科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (165, 20150003, '邓伟', '男', 34, '18156789012', '主任医师', '慢病科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (166, 20150004, '王健', '男', 38, '15067890123', '主任医师', '疼痛科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (167, 20150005, '李婷', '女', 52, '18878901234', '主任医师', '心理咨询科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (168, 20150006, '张琳', '女', 56, '15989012345', '主任医师', '皮肤美容科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (169, 20150007, '陈雨', '女', 31, '13690123456', '主任医师', '内科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (170, 20150008, '周翔', '男', 48, '18201234567', '主任医师', '外科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (171, 20150009, '王浩', '男', 60, '15712345678', '主任医师', '心血管内科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (172, 20150010, '陈峰', '男', 59, '13923456789', '主任医师', '消化内科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (173, 20150011, '李旭', '男', 34, '15634567890', '主任医师', '血液内科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (174, 20150012, '刘涛', '男', 52, '15845678901', '主任医师', '肾内科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (175, 20150013, '杨晨', '女', 43, '15056789012', '主任医师', '呼吸内科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (176, 20150014, '王飞', '男', 49, '18367890123', '主任医师', '风湿免疫科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (177, 20150015, '王翔', '男', 54, '17878901234', '主任医师', '内分泌科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (178, 20150016, '杨磊', '男', 58, '13589012345', '主任医师', '儿科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (179, 20150017, '李静', '女', 56, '15190123456', '主任医师', '妇产科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (180, 20150018, '刘飞', '男', 51, '15501234567', '主任医师', '男科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (181, 20150019, '李雪', '女', 42, '18712345678', '主任医师', '眼科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (182, 20150020, '刘鹏', '男', 30, '13923456789', '主任医师', '耳鼻喉科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (183, 20150021, '王丽丽', '女', 55, '18934567890', '主任医师', '口腔科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (184, 20150022, '张翔', '男', 49, '13645678901', '主任医师', '皮肤科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (185, 20150023, '陈浩', '男', 36, '18056789012', '主任医师', '精神科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (186, 20150024, '杨丽', '女', 53, '15967890123', '主任医师', '感染科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (187, 20150025, '陈风', '男', 50, '18278901234', '主任医师', '中医科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (188, 20150026, '李健', '男', 48, '13689012345', '主任医师', '肝病科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (189, 20150027, '吴勇', '男', 47, '18590123456', '主任医师', '心胸外科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (190, 20150028, '刘健', '男', 49, '15601234567', '主任医师', '神经外科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (191, 20150029, '吴强', '男', 48, '18712345678', '主任医师', '泌尿外科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (192, 20150030, '刘洋', '男', 50, '13923456789', '主任医师', '整形外科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (193, 20150031, '吴琳', '女', 49, '15234567890', '主任医师', '病理科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (194, 20150032, '刘强', '男', 51, '13445678901', '主任医师', '放射科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (195, 20150033, '吴丹', '女', 50, '18156789012', '主任医师', '肿瘤科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (196, 20150034, '刘琳', '女', 50, '15067890123', '主任医师', '骨科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (197, 20150035, '吴华', '女', 51, '18878901234', '主任医师', '牙科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (198, 20150036, '刘燕', '女', 53, '15989012345', '主任医师', '影像科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (199, 20150037, '孙慧', '女', 40, '13690123456', '主任医师', '医学美容科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (200, 20150038, '张飞', '男', 56, '18201234567', '主任医师', '老年病科', '周五', '2023-12-01 23:53:32', '2023-12-01 23:53:32');
INSERT INTO `doctors` VALUES (201, 20150036, '李文昊', '男', 21, '18422019489', '主任医师', '口腔科', '周二', '2023-12-21 22:37:11', '2023-12-21 22:37:11');
INSERT INTO `doctors` VALUES (202, 20110002, '李文丽', '女', 21, '16582904452', '实习医师', '内科', '周四', '2023-12-20 21:58:50', '2023-12-20 21:58:50');
INSERT INTO `doctors` VALUES (203, 20110003, '王富文', '男', 44, '17622894019', '实习医师', '医学美容科', '周二', '2023-12-20 22:06:45', '2023-12-20 22:06:45');

-- ----------------------------
-- Table structure for medical_records
-- ----------------------------
DROP TABLE IF EXISTS `medical_records`;
CREATE TABLE `medical_records`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `patient_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `doctor_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `doctor_id` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `record_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `record_results` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 201 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of medical_records
-- ----------------------------
INSERT INTO `medical_records` VALUES (1, '白冰奎', '赵宇', '20120001', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (2, '白泓屹', '刘鹏', '20120002', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (3, '柏茹婵', '周雪', '20120003', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (4, '班筝可', '马婷', '20120004', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (5, '包会纪', '姚晨', '20120005', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (6, '包静沙', '李杰', '20120006', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (7, '薄沛婧', '王娜', '20120007', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (8, '鲍汉响', '杨娜', '20120008', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (9, '邴通卿', '赵强', '20120009', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (10, '邴纬镇', '陈娜', '20120010', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (11, '蔡才俊', '韩兵', '20120011', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (12, '蔡万岳', '王梅', '20120012', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (13, '曹辰嵘', '高磊', '20120013', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (14, '常蝶文', '李晨', '20120014', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (15, '常妍竹', '赵梓', '20120015', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (16, '陈津泳', '李娜', '20120016', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (17, '褚红晓', '刘晨', '20120017', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (18, '崔斐进', '周娜', '20120018', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (19, '单焘冕', '王洁', '20120019', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (20, '翟椒春', '王阳', '20120020', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (21, '翟京滨', '周娟', '20120021', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (22, '刁珠贞', '赵晓', '20120022', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (23, '董尚韬', '刘婷', '20120023', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (24, '窦丞微', '王萍', '20120024', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (25, '杜铮阔', '王风', '20120025', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (26, '樊龙浩', '刘洁', '20120026', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (27, '范然喻', '陈晓丽', '20120027', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (28, '范彤菡', '陈梅', '20120028', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (29, '范文晟', '刘静', '20120029', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (30, '费品勃', '刘丽', '20120030', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (31, '冯兰妃', '杨丹', '20120031', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (32, '凤娟品', '张霞', '20120032', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (33, '伏笛昂', '周萍', '20120033', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (34, '伏茜薇', '李霞', '20120034', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (35, '伏曦剑', '周琳', '20120035', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (36, '伏妍桢', '张梅', '20120036', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (37, '富媛言', '周华', '20120037', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (38, '高卉朵', '张琳', '20120038', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (39, '郜虹瑗', '周勇', '20120039', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (40, '郜闽鹏', '张华', '20120040', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (41, '葛杉隽', '周杰', '20120041', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (42, '龚旭雁', '陈明', '20120042', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (43, '贡联银', '王霞', '20120043', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (44, '贡尤妃', '刘杰', '20120044', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (45, '管雄来', '李明', '20120045', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (46, '韩逸苹', '陈梦', '20130001', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (47, '杭高景', '王璐', '20130002', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (48, '何元萱', '朱浩', '20130003', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (49, '华定益', '孙泽', '20130004', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (50, '滑炯卿', '魏冰', '20130005', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (51, '滑军健', '杨林', '20130006', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (52, '滑桃妙', '陈涛', '20130007', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (53, '怀素梦', '王晨', '20130008', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (54, '惠罡启', '赵莉', '20130009', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (55, '惠洵玲', '张飞', '20130010', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (56, '霍卿伊', '李雨', '20130011', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (57, '霍晏博', '张峰', '20130012', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (58, '姬靓钥', '徐丽', '20130013', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (59, '姬生鲲', '王露', '20130014', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (60, '嵇跃逸', '刘明', '20130015', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (61, '吉争琼', '李云', '20130016', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (62, '计旎璐', '周平', '20130017', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (63, '江柳丹', '刘静', '20130018', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (64, '江双熹', '王志', '20130019', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (65, '姜驰中', '赵平', '20130020', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (66, '姜葵慈', '周华', '20130021', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (67, '姜骞日', '李龙', '20130022', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (68, '蒋野允', '刘宇', '20130023', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (69, '焦望枫', '陈杰', '20130024', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (70, '焦宇耀', '孙鹏', '20130025', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (71, '经尚弘', '张琦', '20130026', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (72, '经莹蓓', '刘阳', '20130027', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (73, '井羿渊', '孙伟', '20130028', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (74, '柯兰晨', '张磊', '20130030', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (75, '郎德章', '李飞', '20130031', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (76, '劳媚榕', '韩娜', '20130032', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (77, '劳亚珉', '程涛', '20130033', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (78, '李诗晶', '朱晨', '20130034', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (79, '林旦昊', '张莉', '20130035', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (80, '林鹰为', '刘飞', '20130036', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (81, '凌力任', '王琳', '20130037', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (82, '凌沙静', '张鹏', '20130038', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (83, '刘晨隽', '李峰', '20130039', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (84, '刘衡月', '张丽', '20130040', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (85, '刘彤筱', '赵磊', '20130041', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (86, '柳心亚', '李娟', '20130042', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (87, '龙逊灿', '张浩', '20130043', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (88, '陆魁炜', '李梅', '20130044', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (89, '陆银山', '陈涛', '20130045', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (90, '陆知美', '王晨', '20130046', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (91, '骆超江', '陈飞', '20130047', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (92, '吕良俭', '张杰', '20130048', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (93, '马胤平', '陈峰', '20130049', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (94, '毛殉振', '张丹', '20130050', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (95, '孟坤韶', '赵涛', '20130051', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (96, '苗璇荔', '张晓琳', '20130052', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (97, '苗熠兴', '王浩', '20130053', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (98, '苗珍歆', '张峰', '20130054', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (99, '明澄曙', '杨浩', '20130055', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (100, '明佳河', '李婷', '20130056', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (101, '牧音莺', '赵翔', '20130057', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (102, '农声策', '王涛', '20130058', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (103, '农音纳', '赵浩', '20130059', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (104, '潘纪岑', '张梅', '20130060', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (105, '彭研征', '王磊', '20130061', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (106, '平山盼', '王伟', '20130062', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (107, '戚驰烽', '孙强', '20130063', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (108, '齐寒煊', '陈良', '20130064', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (109, '祁幸心', '王俊', '20130065', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (110, '钱军滨', '孙华', '20130066', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (111, '钱日沫', '陈敏', '20130067', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (112, '钱如杨', '李杰', '20130068', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (113, '强东崧', '孙丹', '20130069', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (114, '强乐戈', '陈勇', '20130070', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (115, '乔冰习', '李华', '20130071', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (116, '乔申威', '孙杰', '20130072', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (117, '屈颖芸', '陈琳', '20130073', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (118, '瞿愉樱', '李丹', '20130074', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (119, '瞿庄旺', '孙平', '20130075', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (120, '荣诺齐', '陈强', '20130076', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (121, '芮栋菊', '杨军', '20130077', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (122, '芮素盈', '杜伟', '20130078', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (123, '尚笛鸽', '陈萍', '20130079', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (124, '韶沙晟', '张阳', '20140001', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (125, '申澜鑫', '高伟', '20140002', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (126, '施盈樱', '刘芳', '20140003', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (127, '时灵骊', '刘冬', '20140004', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (128, '舒婵梅', '张禹', '20140005', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (129, '舒凝影', '张洋', '20140006', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (130, '束骏革', '王斌', '20140007', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (131, '水皎泽', '宋雪', '20140008', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (132, '水韬纲', '吴芳', '20140009', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (133, '司俭昊', '杨静', '20140010', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (134, '司翊嘉', '陈晨', '20140011', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (135, '松林存', '刘磊', '20140012', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (136, '宋存韬', '孙静', '20140013', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (137, '宋雪珍', '张婷', '20140014', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (138, '宋妍可', '杨静', '20140015', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (139, '孙京情', '杨飞', '20140016', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (140, '孙真炯', '李萍', '20140017', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (141, '谭麟岑', '王涛', '20140018', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (142, '唐璇攀', '张雪', '20140019', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (143, '陶斐蓉', '李磊', '20140020', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (144, '滕耘晗', '刘娟', '20140021', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (145, '童晴宁', '赵丽', '20140022', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (146, '汪珏爱', '朱敏', '20140023', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (147, '汪晴瑗', '张娟', '20140024', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (148, '卫楷纯', '赵丹', '20140025', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (149, '魏妲美', '朱勇', '20140026', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (150, '魏辛渤', '王平', '20140027', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (151, '魏壮舜', '赵勇', '20140028', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (152, '温眉妲', '朱强', '20140029', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (153, '翁双澄', '王丹', '20140030', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (154, '翁昭福', '赵平', '20140031', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (155, '乌骞季', '朱华', '20140032', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (156, '邬茉允', '王强', '20140033', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (157, '邬涛宾', '赵强', '20140034', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (158, '伍彤诗', '朱琳', '20140035', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (159, '伍珍一', '王娟', '20140036', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (160, '武清驰', '张勇', '20140037', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (161, '奚蝶曼', '赵敏', '20140038', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (162, '奚若滢', '王艳', '20140039', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (163, '夏凯友', '李秋', '20150001', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (164, '谢治澜', '周琳', '20150002', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (165, '邢颢燃', '邓伟', '20150003', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (166, '幸荷眉', '王健', '20150004', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (167, '幸韶越', '李婷', '20150005', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (168, '徐庚旭', '张琳', '20150006', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (169, '徐蔓希', '陈雨', '20150007', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (170, '许来领', '周翔', '20150008', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (171, '许瑶格', '王浩', '20150009', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (172, '严群忻', '陈峰', '20150010', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (173, '严昀轶', '李旭', '20150011', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (174, '晏泰魁', '刘涛', '20150012', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (175, '晏逸希', '杨晨', '20150013', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (176, '杨绮莺', '王飞', '20150014', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (177, '叶和钦', '王翔', '20150015', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (178, '殷啸利', '杨磊', '20150016', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (179, '尹霁立', '李静', '20150017', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (180, '尹元林', '刘飞', '20150018', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (181, '俞功羿', '李雪', '20150019', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (182, '虞鸽艾', '刘鹏', '20150020', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (183, '虞或令', '王丽丽', '20150021', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (184, '袁言纯', '张翔', '20150022', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (185, '云菁亚', '陈浩', '20150023', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (186, '詹眉咪', '杨丽', '20150024', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (187, '张飙逸', '陈风', '20150025', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (188, '张银杉', '李健', '20150026', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (189, '郑洁昕', '吴勇', '20150027', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (190, '郑牧柏', '刘健', '20150028', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (191, '郑念秋', '吴强', '20150029', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (192, '仲晨品', '刘洋', '20150030', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (193, '周珉君', '吴琳', '20150031', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (194, '周游海', '刘强', '20150032', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (195, '周玥虹', '吴丹', '20150033', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (196, '朱忱其', '刘琳', '20150034', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (197, '祝楚峥', '吴华', '20150035', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (198, '祝琴意', '刘燕', '20150036', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (199, '宗昶铎', '孙慧', '20150037', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');
INSERT INTO `medical_records` VALUES (200, '宗玺登', '张飞', '20150038', NULL, NULL, '2023-12-24 15:11:17', '2023-12-24 15:11:24');

-- ----------------------------
-- Table structure for medicines
-- ----------------------------
DROP TABLE IF EXISTS `medicines`;
CREATE TABLE `medicines`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `medicine_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `medicine_brand` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `medicine_company` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `specification` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `unit_price` decimal(10, 2) NULL DEFAULT NULL,
  `approval_number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `storage` int NULL DEFAULT NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 18 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of medicines
-- ----------------------------
INSERT INTO `medicines` VALUES (1, '莲花清瘟胶囊', '连花', '上海', '0.35g*24粒/盒', 9.90, 'Z20040063', 5000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (2, '复方金银花颗粒', '修正', '江苏', '10g*10袋', 29.80, 'Z20063606', 1000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (3, '小柴胡颗粒', '999', '北京', '10g*9袋', 12.80, 'Z44020709 ', 3000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (4, '双黄连口服液', '三精', '广东', '10ml*10支', 15.90, 'Z10920053', 1000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (5, '板蓝根颗粒', '白云山', '浙江', '15g*20袋', 19.80, 'Z44023485', 2000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (6, '板蓝根颗粒', '999', '江苏', '10g*20袋', 17.10, 'Z44023485', 1000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (7, '藿香正气口服液', '太极', '江苏', '10ml*10支', 14.00, 'Z50020409', 2000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (8, '逍遥丸', '九芝堂', '江苏', '200粒/盒', 12.98, 'Z43020469 ', 3000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (9, '健胃消食片', '江中', '浙江', '0.8g*64片/盒', 12.20, 'Z20013220 ', 1000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (10, '蜜炼川贝枇杷膏', '京都念慈庵', '广东', '150ml/瓶/盒', 33.80, 'ZC20160006', 2000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (11, '布洛芬缓释胶囊', '中美史克', '上海', '0.3g*24粒/盒', 19.90, 'H20013062', 4000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (12, '珍珠明目滴眼液', '苏春', '广东', '8ml/盒', 4.13, 'Z20073104 ', 2000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (13, '水杨酸苯酚贴膏', '恒健', '浙江', '6片/盒', 6.50, 'H44024190 ', 1000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');
INSERT INTO `medicines` VALUES (14, '复方葡萄糖酸钙口服溶液', '三精', '江苏', '10ml*16支/盒', 19.80, 'H10910063', 3000, '2023-12-26 20:08:49', '2023-12-26 20:12:56');

-- ----------------------------
-- Table structure for nursing
-- ----------------------------
DROP TABLE IF EXISTS `nursing`;
CREATE TABLE `nursing`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `nurse_id` int NULL DEFAULT NULL,
  `nurse_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `gender` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `age` int NULL DEFAULT NULL,
  `phone_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `patient_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `nursing_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `nursing_id`(`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of nursing
-- ----------------------------
INSERT INTO `nursing` VALUES (1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (3, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (5, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (6, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (9, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `nursing` VALUES (10, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);

-- ----------------------------
-- Table structure for patients
-- ----------------------------
DROP TABLE IF EXISTS `patients`;
CREATE TABLE `patients`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `patient_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `gender` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `age` int NULL DEFAULT NULL,
  `phone_number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 206 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of patients
-- ----------------------------
INSERT INTO `patients` VALUES (1, '白冰奎', '男', 31, '17735436906', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (2, '白泓屹', '男', 71, '18620381876', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (3, '柏茹婵', '女', 61, '18337911079', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (4, '班筝可', '女', 10, '17345635641', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (5, '包会纪', '男', 20, '13929848354', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (6, '包静沙', '女', 66, '17330567026', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (7, '薄沛婧', '女', 11, '14915631983', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (8, '鲍汉响', '男', 35, '18842984144', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (9, '邴通卿', '男', 59, '13186798192', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (10, '邴纬镇', '男', 29, '15842429669', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (11, '蔡才俊', '男', 24, '13023155036', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (12, '蔡万岳', '男', 40, '13459282494', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (13, '曹辰嵘', '女', 52, '13943119212', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (14, '常蝶文', '女', 29, '17695223010', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (15, '常妍竹', '女', 10, '18821779442', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (16, '陈津泳', '男', 76, '19896923473', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (17, '褚红晓', '女', 40, '16523565281', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (18, '崔斐进', '男', 74, '13211698268', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (19, '单焘冕', '男', 48, '13455791217', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (20, '翟椒春', '女', 21, '15327935008', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (21, '翟京滨', '男', 49, '18211308357', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (22, '刁珠贞', '女', 22, '17353806605', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (23, '董尚韬', '男', 37, '18369574414', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (24, '窦丞微', '男', 16, '18017184074', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (25, '杜铮阔', '男', 67, '18490411373', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (26, '樊龙浩', '男', 41, '15093116446', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (27, '范然喻', '女', 74, '15022303883', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (28, '范彤菡', '女', 78, '15693341829', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (29, '范文晟', '女', 73, '15654075639', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (30, '费品勃', '男', 39, '18711575851', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (31, '冯兰妃', '女', 38, '13029832058', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (32, '凤娟品', '女', 16, '13855041268', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (33, '伏笛昂', '男', 50, '14596302234', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (34, '伏茜薇', '女', 48, '18044788502', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (35, '伏曦剑', '女', 63, '18812921259', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (36, '伏妍桢', '女', 44, '17515574691', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (37, '富媛言', '女', 58, '17752391294', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (38, '高卉朵', '女', 38, '19861127977', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (39, '郜虹瑗', '女', 69, '18767497491', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (40, '郜闽鹏', '男', 72, '18260838580', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (41, '葛杉隽', '男', 80, '18665116412', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (42, '龚旭雁', '男', 11, '15766264054', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (43, '贡联银', '男', 57, '15928415636', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (44, '贡尤妃', '女', 64, '18023476033', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (45, '管雄来', '男', 21, '18333765816', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (46, '韩逸苹', '女', 28, '18166108201', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (47, '杭高景', '男', 47, '13012538385', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (48, '何元萱', '女', 50, '13805809475', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (49, '华定益', '男', 61, '19866198510', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (50, '滑炯卿', '女', 12, '13828752793', '2023-12-20 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (51, '滑军健', '男', 20, '15777324184', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (52, '滑桃妙', '女', 52, '15158996926', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (53, '怀素梦', '女', 39, '17720877745', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (54, '惠罡启', '男', 63, '13990239615', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (55, '惠洵玲', '女', 19, '17155434808', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (56, '霍卿伊', '女', 68, '15230836111', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (57, '霍晏博', '男', 63, '15110642869', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (58, '姬靓钥', '女', 28, '13620241964', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (59, '姬生鲲', '男', 38, '15526351741', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (60, '嵇跃逸', '男', 17, '15865878071', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (61, '吉争琼', '男', 65, '13436481965', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (62, '计旎璐', '女', 75, '17830549056', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (63, '江柳丹', '女', 77, '17118897147', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (64, '江双熹', '男', 58, '15147902239', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (65, '姜驰中', '男', 41, '18885757502', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (66, '姜葵慈', '女', 21, '13659537504', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (67, '姜骞日', '男', 23, '15006232409', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (68, '蒋野允', '女', 69, '18561862342', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (69, '焦望枫', '男', 79, '13192446960', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (70, '焦宇耀', '男', 48, '18978426305', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (71, '经尚弘', '男', 47, '17116997078', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (72, '经莹蓓', '女', 19, '13728136899', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (73, '井羿渊', '男', 67, '13045162095', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (74, '柯兰晨', '女', 21, '15122358537', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (75, '郎德章', '男', 62, '18894087306', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (76, '劳媚榕', '女', 50, '16626372692', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (77, '劳亚珉', '男', 20, '17591987733', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (78, '李诗晶', '女', 45, '15249579501', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (79, '林旦昊', '男', 65, '19970559055', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (80, '林鹰为', '男', 76, '15628185450', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (81, '凌力任', '男', 71, '14580897292', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (82, '凌沙静', '女', 21, '13662249787', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (83, '刘晨隽', '女', 31, '18178016607', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (84, '刘衡月', '男', 49, '17331926140', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (85, '刘彤筱', '女', 40, '15241431192', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (86, '柳心亚', '女', 32, '13018385400', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (87, '龙逊灿', '男', 78, '16536031080', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (88, '陆魁炜', '男', 68, '13255452861', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (89, '陆银山', '男', 55, '15067372337', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (90, '陆知美', '女', 45, '15048804714', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (91, '骆超江', '男', 73, '19812593750', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (92, '吕良俭', '女', 28, '13865454141', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (93, '马胤平', '男', 25, '17669188377', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (94, '毛殉振', '女', 50, '15112434175', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (95, '孟坤韶', '男', 56, '17367988339', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (96, '苗璇荔', '女', 64, '14532044957', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (97, '苗熠兴', '男', 23, '19974742543', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (98, '苗珍歆', '男', 55, '13148236196', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (99, '明澄曙', '男', 51, '18965437581', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (100, '明佳河', '男', 11, '18026297343', '2023-12-21 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (101, '牧音莺', '女', 47, '19981215224', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (102, '农声策', '男', 34, '18042207290', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (103, '农音纳', '女', 49, '17126521199', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (104, '潘纪岑', '男', 23, '17797135541', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (105, '彭研征', '男', 30, '13439774846', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (106, '平山盼', '男', 57, '15228581328', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (107, '戚驰烽', '男', 56, '13170291585', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (108, '齐寒煊', '男', 41, '17866908088', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (109, '祁幸心', '女', 41, '13334833297', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (110, '钱军滨', '男', 39, '13072666738', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (111, '钱日沫', '女', 20, '13709494233', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (112, '钱如杨', '女', 12, '17792593695', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (113, '强东崧', '男', 31, '19808323419', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (114, '强乐戈', '女', 25, '13847461910', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (115, '乔冰习', '女', 55, '18485454577', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (116, '乔申威', '男', 22, '19917644988', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (117, '屈颖芸', '女', 19, '17196735324', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (118, '瞿愉樱', '女', 51, '17160773641', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (119, '瞿庄旺', '男', 41, '13326417063', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (120, '荣诺齐', '男', 18, '13347873115', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (121, '芮栋菊', '女', 66, '17686156207', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (122, '芮素盈', '女', 24, '19949354852', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (123, '尚笛鸽', '女', 43, '18417972946', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (124, '韶沙晟', '女', 42, '15110807555', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (125, '申澜鑫', '男', 18, '13673016896', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (126, '施盈樱', '女', 11, '18937024328', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (127, '时灵骊', '女', 70, '14555142313', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (128, '舒婵梅', '女', 54, '16555965136', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (129, '舒凝影', '女', 34, '15328214784', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (130, '束骏革', '男', 76, '18028299246', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (131, '水皎泽', '女', 36, '13035564328', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (132, '水韬纲', '男', 80, '15810971961', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (133, '司俭昊', '男', 50, '13561553839', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (134, '司翊嘉', '男', 18, '13008284888', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (135, '松林存', '男', 70, '15872206758', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (136, '宋存韬', '男', 49, '18229211524', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (137, '宋雪珍', '女', 62, '19882761561', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (138, '宋妍可', '女', 48, '17340057202', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (139, '孙京情', '女', 78, '15350026811', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (140, '孙真炯', '女', 21, '15761012612', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (141, '谭麟岑', '男', 47, '14775304591', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (142, '唐璇攀', '男', 51, '15712375548', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (143, '陶斐蓉', '女', 73, '15100234800', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (144, '滕耘晗', '女', 69, '13746122115', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (145, '童晴宁', '女', 10, '18719738846', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (146, '汪珏爱', '女', 31, '17343857117', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (147, '汪晴瑗', '女', 52, '15802829033', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (148, '卫楷纯', '男', 78, '17845527308', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (149, '魏妲美', '女', 54, '15635442887', '2023-12-22 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (150, '魏辛渤', '男', 60, '13630927755', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (151, '魏壮舜', '男', 28, '18844251771', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (152, '温眉妲', '女', 10, '14714747742', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (153, '翁双澄', '男', 13, '13318655192', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (154, '翁昭福', '男', 34, '15092255143', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (155, '乌骞季', '男', 57, '17644792434', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (156, '邬茉允', '女', 45, '19806424053', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (157, '邬涛宾', '男', 35, '15989045038', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (158, '伍彤诗', '女', 28, '15663464746', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (159, '伍珍一', '女', 14, '18932418983', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (160, '武清驰', '男', 20, '15339829475', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (161, '奚蝶曼', '女', 38, '18554367983', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (162, '奚若滢', '女', 29, '19868535167', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (163, '夏凯友', '男', 49, '18869558582', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (164, '谢治澜', '男', 17, '13765131140', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (165, '邢颢燃', '男', 19, '18208302072', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (166, '幸荷眉', '女', 49, '18963988491', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (167, '幸韶越', '男', 21, '18470452746', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (168, '徐庚旭', '男', 20, '13146422503', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (169, '徐蔓希', '女', 19, '18673547336', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (170, '许来领', '男', 68, '13260582028', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (171, '许瑶格', '女', 56, '13964353334', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (172, '严群忻', '女', 49, '13323098624', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (173, '严昀轶', '女', 23, '13488605210', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (174, '晏泰魁', '男', 70, '14905308950', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (175, '晏逸希', '女', 37, '17190753318', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (176, '杨绮莺', '女', 45, '13247986227', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (177, '叶和钦', '男', 39, '18785806781', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (178, '殷啸利', '男', 23, '18187663900', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (179, '尹霁立', '女', 42, '15716166769', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (180, '尹元林', '女', 56, '13810558186', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (181, '俞功羿', '男', 22, '13696171992', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (182, '虞鸽艾', '女', 56, '18286191478', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (183, '虞或令', '女', 35, '18844621326', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (184, '袁言纯', '女', 66, '15083099903', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (185, '云菁亚', '女', 61, '18162525786', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (186, '詹眉咪', '女', 13, '13595443528', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (187, '张飙逸', '男', 60, '15774312705', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (188, '张银杉', '男', 28, '18593464842', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (189, '郑洁昕', '女', 54, '18290088109', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (190, '郑牧柏', '男', 32, '18005601976', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (191, '郑念秋', '女', 28, '15242829054', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (192, '仲晨品', '女', 54, '14546061209', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (193, '周珉君', '男', 51, '18980799582', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (194, '周游海', '女', 70, '16638807190', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (195, '周玥虹', '女', 68, '16601822406', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (196, '朱忱其', '男', 18, '15540344869', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (197, '祝楚峥', '男', 10, '15225735378', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (198, '祝琴意', '女', 44, '15355427798', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (199, '宗昶铎', '男', 65, '15992499801', '2023-12-23 10:02:13', '2023-12-23 10:02:13');
INSERT INTO `patients` VALUES (200, '宗玺登', '男', 34, '15872538126', '2023-12-23 10:02:13', '2023-12-23 10:02:13');

-- ----------------------------
-- Table structure for positions
-- ----------------------------
DROP TABLE IF EXISTS `positions`;
CREATE TABLE `positions`  (
  `position_id` int NOT NULL,
  `position_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `position_type` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `department_id` int NULL DEFAULT NULL,
  `salary` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `position_description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `qualification_requirements` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  PRIMARY KEY (`position_id`) USING BTREE,
  INDEX `department_id`(`department_id`) USING BTREE,
  INDEX `position_name`(`position_name`) USING BTREE,
  INDEX `salary`(`salary`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of positions
-- ----------------------------
INSERT INTO `positions` VALUES (1011, '行政助理', '行政人员', 101, '3000-8000元', '协助行政部门的日常工作，包括文件管理、会议安排、行政支持等', '良好的沟通能力和组织能力，熟练掌握办公软件');
INSERT INTO `positions` VALUES (1012, '行政专员', '行政人员', 101, '4000-10000元', '负责行政事务的处理和协调，包括文件管理、办公室设施维护等', '具备一定的行政工作经验，熟悉办公软件操作');
INSERT INTO `positions` VALUES (1013, '行政主任', '行政人员', 101, '5000-15000元', '负责行政部门的管理和协调，包括人员安排、预算管理等', '较强的组织和管理能力，有相关行政管理经验');
INSERT INTO `positions` VALUES (1014, '副院长', '行政人员', 101, '15000-50000元', '协助院长管理医院的日常运营，包括制定发展战略、监督部门工作等', '深厚的医疗管理经验，熟悉医院运营管理流程');
INSERT INTO `positions` VALUES (1015, '院长', '行政人员', 101, '30000-100000元', '负责医院的全面管理和决策，包括战略规划、资源调配等', '深厚的医疗行业背景和管理经验，良好的领导能力');
INSERT INTO `positions` VALUES (1021, '值班员', '安保人员', 102, '2000-5000元', '负责医院部门的值班工作，包括接听电话、记录信息等', '细心和耐心，熟悉医院内部流程和相关操作');
INSERT INTO `positions` VALUES (1022, '消防员', '安保人员', 102, '3000-8000元', '负责医院的消防工作，包括火灾防控、应急救援等', '持有国家消防员资格证书，具备相关消防知识和技能');
INSERT INTO `positions` VALUES (1023, '技防员', '安保人员', 102, '3000-8000元', '负责医院的技术防范工作，包括监控系统维护、安全设备管理等', '熟悉技术防范设备操作和维护');
INSERT INTO `positions` VALUES (1024, '物防员', '安保人员', 102, '3000-8000元', '负责医院的物资防范工作，包括财物保管、盘点等', '仔细和谨慎的工作态度，熟悉物资管理流程');
INSERT INTO `positions` VALUES (1025, '防暴警察', '安保人员', 102, '5000-12000元', '负责医院的治安和秩序维护工作，应对突发事件和紧急情况', '公安机关培训和警务经验，熟悉应急处置程序');
INSERT INTO `positions` VALUES (1026, '安保队长', '安保人员', 102, '8000-20000元', '负责医院的安保工作，组织安保队伍，制定安全管理策略', '丰富的安保工作经验和领导能力，了解安全管理相关法规和标准');
INSERT INTO `positions` VALUES (1027, '安保主管', '安保人员', 102, '6000-15000元', '负责医院的安保工作，协调安保人员，监督安全措施的执行', '一定的安保管理经验，熟悉安全管理流程和应急预案');
INSERT INTO `positions` VALUES (1031, '收费员', '财务人员', 103, '2500-6000元', '负责医院的收费工作，包括收取患者费用、开具发票等', '熟悉收费流程和医疗保险相关政策');
INSERT INTO `positions` VALUES (1032, '财务专员', '财务人员', 103, '3000-8000元', '协助财务部门的日常工作，包括账务处理、报表分析等', '具备财务相关专业知识和操作经验');
INSERT INTO `positions` VALUES (1033, '会计专员', '财务人员', 103, '3500-9000元', '负责医院的会计核算和财务管理工作，包括账目整理、报税申报等', '具备会计相关专业知识和操作经验');
INSERT INTO `positions` VALUES (1034, '财务主管', '财务人员', 103, '8000-20000元', '负责医院财务部门的管理和决策，包括预算编制、财务分析等', '具备较强的财务管理能力和相关经验');
INSERT INTO `positions` VALUES (1041, '法务助理', '法务人员', 104, '4000-10000元', '协助法务部门的日常工作，包括合同起草、法律事务处理等', '具备法律专业背景和相关工作经验');
INSERT INTO `positions` VALUES (1042, '法务顾问', '法务人员', 104, '10000-30000元', '提供法律咨询和法律意见，协助解决法律问题和纠纷', '具备法学或相关法律专业背景，有执业经验');
INSERT INTO `positions` VALUES (1043, '法务主管', '法务人员', 104, '12000-40000元', '负责医院法务部门的管理和协调，包括合同审查、法律风险评估等', '具备丰富的法务管理经验和深入了解法律法规');
INSERT INTO `positions` VALUES (1051, '招聘专员', '人事人员', 105, '3500-9000元', '负责医院的招聘工作，包括发布招聘信息、筛选简历、面试安排等', '具备人力资源管理知识和相关招聘经验');
INSERT INTO `positions` VALUES (1052, '培训专员', '人事人员', 105, '3500-9000元', '负责医院的员工培训和发展工作，包括制定培训计划、组织培训活动等', '具备培训设计和组织能力，熟悉培训评估方法');
INSERT INTO `positions` VALUES (1053, '员工专员', '人事人员', 105, '3000-8000元', '协助人事部门的日常工作，包括员工档案管理、福利待遇处理等', '具备一定的人力资源管理知识和相关工作经验');
INSERT INTO `positions` VALUES (1054, '人事专员', '人事人员', 105, '3500-9000元', '负责医院的人事管理工作，包括招聘、培训、绩效考核等', '具备人力资源管理知识和相关工作经验');
INSERT INTO `positions` VALUES (1055, '人事主管', '人事人员', 105, '8000-20000元', '负责医院人事部门的管理和协调，包括人事政策制定、员工关系处理等', '具备较强的人力资源管理能力和相关经验');
INSERT INTO `positions` VALUES (2011, '实习医师', '医务人员', 201, '3000-6000元', '在医院进行临床实习，参与病人诊断和治疗工作', '拥有医学学士学位，并通过国家医师资格考试');
INSERT INTO `positions` VALUES (2012, '助理医师', '医务人员', 201, '5000-8000元', '协助医生进行诊断、治疗和手术等工作', '拥有医学学士学位，并通过国家医师资格考试');
INSERT INTO `positions` VALUES (2013, '主治医师', '医务人员', 201, '8000-15000元', '负责独立诊断、治疗和手术等工作', '拥有医学硕士学位，并通过国家医师资格考试');
INSERT INTO `positions` VALUES (2014, '副主任医师', '医务人员', 201, '15000-25000元', '负责指导和管理医疗团队，参与重要病例的诊断和治疗', '拥有医学博士学位，并通过国家医师资格考试');
INSERT INTO `positions` VALUES (2015, '主任医师', '医务人员', 201, '25000-50000元', '负责医院的重要专科或学科的治疗和管理工作', '拥有医学博士学位，并通过国家医师资格考试');
INSERT INTO `positions` VALUES (2021, '注册护士', '护理人员', 202, '3000-8000元', '负责病人的基础护理工作，包括测量生命体征、给药、换药等', '拥有注册护士资格证书');
INSERT INTO `positions` VALUES (2022, '执业护士', '护理人员', 202, '5000-10000元', '在医生指导下负责病人的护理工作', '拥有注册护士资格证书');
INSERT INTO `positions` VALUES (2023, '产科护士', '护理人员', 202, '6000-12000元', '在产科病房负责孕妇的护理工作', '拥有注册护士资格证书，并具备相关产科护理经验');
INSERT INTO `positions` VALUES (2024, '急诊护士', '护理人员', 202, '6000-12000元', '在急诊科负责急诊患者的护理工作', '拥有注册护士资格证书，并具备相关急诊护理经验');
INSERT INTO `positions` VALUES (2025, 'ICU护士', '护理人员', 202, '8000-15000元', '在重症监护室负责重症患者的护理工作', '拥有注册护士资格证书，并具备相关重症护理经验');
INSERT INTO `positions` VALUES (2026, '手术护士', '护理人员', 202, '8000-15000元', '在手术室负责手术患者的护理工作', '拥有注册护士资格证书，并具备相关手术室护理经验');
INSERT INTO `positions` VALUES (2027, '护士长', '护理人员', 202, '12000-30000元', '负责护士团队的管理和协调工作', '拥有注册护士资格证书，并具备一定的护士管理经验');
INSERT INTO `positions` VALUES (3011, '药剂师', '采购人员', 301, '8000-15000元', '负责药房药品配制、发药和用药指导', '拥有药学专业学士学位，并通过国家执业药师资格考试');
INSERT INTO `positions` VALUES (3012, '采购专员', '采购人员', 301, '5000-10000元', '负责医院日常物资的采购工作', '具备相关采购工作经验');
INSERT INTO `positions` VALUES (3013, '物资专员', '采购人员', 301, '5000-10000元', '负责医院日常物资的管理和分发工作', '具备相关物流管理或仓储管理经验');
INSERT INTO `positions` VALUES (3014, '采购主管', '采购人员', 301, '8000-15000元', '负责医院采购团队的管理和协调工作', '具备丰富的采购管理经验');
INSERT INTO `positions` VALUES (3021, '清洁工人', '卫生人员', 302, '3000-6000元', '负责医院内部清洁工作', '无特殊要求');
INSERT INTO `positions` VALUES (3022, '消毒工人', '卫生人员', 302, '3000-6000元', '负责医院内部消毒工作', '无特殊要求');
INSERT INTO `positions` VALUES (3023, '环境服务工人', '卫生人员', 302, '3000-6000元', '负责医院环境卫生的维护工作', '无特殊要求');
INSERT INTO `positions` VALUES (3024, '废物处理工人', '卫生人员', 302, '3000-6000元', '负责医院废物分类、收集和处理工作', '无特殊要求');
INSERT INTO `positions` VALUES (3025, '卫生主管', '卫生人员', 302, '6000-12000元', '负责医院卫生团队的管理和协调工作', '具备一定的卫生管理经验');
INSERT INTO `positions` VALUES (3031, '服务员', '饮食人员', 303, '3000-6000元', '负责医院病房的食品和饮料服务', '无特殊要求');
INSERT INTO `positions` VALUES (3032, '厨师', '饮食人员', 303, '5000-10000元', '负责医院餐厅的餐饮食品加工和准备', '具备相关厨师工作经验');
INSERT INTO `positions` VALUES (3033, '饮食主管', '饮食人员', 303, '8000-15000元', '负责医院餐饮服务团队的管理和协调工作', '具备丰富的餐饮管理经验');
INSERT INTO `positions` VALUES (3041, '水电工人', '能源人员', 304, '3000-6000元', '负责医院内部水电设施的安装和维护', '有相关水电工作经验');
INSERT INTO `positions` VALUES (3042, '能源主管', '能源人员', 304, '8000-15000元', '负责医院能源供应与管理', '具备丰富的能源管理经验');
INSERT INTO `positions` VALUES (4011, '建筑工人', '建筑人员', 401, '3000-6000元', '参与医院建筑工程的施工和维护', '有相关建筑工作经验');
INSERT INTO `positions` VALUES (4012, '建筑设计师', '建筑人员', 401, '8000-15000元', '负责医院建筑设计与规划', '拥有相关建筑设计师资格或丰富的设计经验');
INSERT INTO `positions` VALUES (4013, '结构工程师', '建筑人员', 401, '8000-15000元', '负责医院建筑结构工程设计与评估', '具备结构工程师资格或相关工程设计经验');
INSERT INTO `positions` VALUES (4014, '机电工程师', '建筑人员', 401, '8000-15000元', '负责医院机电设备的规划与维护', '拥有机电工程师或相关专业背景');
INSERT INTO `positions` VALUES (4015, '工程监理师', '建筑人员', 401, '8000-15000元', '负责医院工程项目的监理与管理', '具备相关工程监理经验或相关资质证书');
INSERT INTO `positions` VALUES (4016, '建筑主管', '建筑人员', 401, '8000-15000元', '负责医院建筑工程团队的管理和协调', '具备丰富的建筑管理经验');
INSERT INTO `positions` VALUES (4021, '医院设备维护员', '维护人员', 402, '4000-8000元', '负责医院医疗设备的维护和保养', '有相关医疗设备维护经验');
INSERT INTO `positions` VALUES (4022, '基础设施维护员', '维护人员', 402, '4000-8000元', '负责医院基础设施的维护和保养', '有相关基础设施维护经验');
INSERT INTO `positions` VALUES (4023, '维护主管', '维护人员', 402, '6000-12000元', '负责医院设施维护团队的管理和协调', '具备一定的设施维护管理经验');
INSERT INTO `positions` VALUES (5011, '软件开发工程师', '技术人员', 501, '8000-15000元', '负责医院信息系统软件开发与维护', '具备计算机或软件工程相关专业背景和工作经验');
INSERT INTO `positions` VALUES (5012, '网络安全员', '技术人员', 501, '8000-15000元', '负责医院信息网络安全保障', '具备网络安全相关专业背景和工作经验');
INSERT INTO `positions` VALUES (5013, '系统管理员', '技术人员', 501, '6000-12000元', '负责医院信息系统的运行与维护', '具备计算机相关专业背景和系统管理经验');
INSERT INTO `positions` VALUES (5014, '数据库管理员', '技术人员', 501, '8000-15000元', '负责医院数据库系统的管理与维护', '具备数据库管理相关专业背景和工作经验');
INSERT INTO `positions` VALUES (5015, '项目经理', '技术人员', 501, '10000-20000元', '负责医院各类项目的规划、实施与管理', '具备项目管理相关经验和团队管理能力');
INSERT INTO `positions` VALUES (5016, '技术主管', '技术人员', 501, '10000-20000元', '负责医院技术团队的管理和协调', '具备丰富的技术管理经验和团队领导能力');

-- ----------------------------
-- Table structure for rooms
-- ----------------------------
DROP TABLE IF EXISTS `rooms`;
CREATE TABLE `rooms`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `room_id` int NULL DEFAULT NULL,
  `room_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `room_head` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 55 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of rooms
-- ----------------------------
INSERT INTO `rooms` VALUES (1, 101, '急诊科', '李秋', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (2, 102, '社区卫生科', '周琳', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (3, 103, '慢病科', '邓伟', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (4, 104, '疼痛科', '王健', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (5, 105, '心理咨询科', '李婷', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (6, 106, '皮肤美容科', '张琳', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (7, 201, '内科', '陈雨', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (8, 202, '外科', '周翔', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (9, 203, '心血管内科', '王浩', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (10, 204, '消化内科', '陈峰', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (11, 205, '血液内科', '李旭', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (12, 206, '肾内科', '刘涛', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (13, 207, '呼吸内科', '杨晨', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (14, 208, '风湿免疫科', '王飞', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (15, 209, '内分泌科', '王翔', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (16, 301, '妇产科', '李静', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (17, 302, '儿科', '杨磊', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (18, 303, '男科', '刘飞', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (19, 304, '眼科', '李雪', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (20, 305, '耳鼻喉科', '刘鹏', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (21, 306, '口腔科', '王丽丽', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (22, 307, '皮肤科', '张翔', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (23, 308, '精神科', '陈浩', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (24, 309, '中医科', '陈风', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (25, 310, '感染科', '杨丽', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (26, 311, '肝病科', '李静', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (27, 401, '心胸外科', '吴勇', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (28, 402, '神经外科', '刘健', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (29, 403, '泌尿外科', '吴强', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (30, 404, '整形外科', '刘洋', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (31, 405, '康复医学科', '朱强', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (32, 406, '病理科', '吴琳', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (33, 407, '放射科', '刘强', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (34, 408, '肿瘤科', '吴丹', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (35, 409, '骨科', '刘琳', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (36, 410, '牙科', '吴华', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (37, 411, '影像科', '刘燕', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (38, 412, '老年病科', '张飞', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (39, 413, '医学美容科', '孙慧', '2023-12-02 15:55:37', '2023-12-02 15:56:37');
INSERT INTO `rooms` VALUES (40, 414, '性病科', '王艳', '2023-12-02 15:55:37', '2023-12-02 15:56:37');

-- ----------------------------
-- Table structure for staff
-- ----------------------------
DROP TABLE IF EXISTS `staff`;
CREATE TABLE `staff`  (
  `staff_id` int NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `gender` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `age` int NULL DEFAULT NULL,
  `department_id` int NULL DEFAULT NULL,
  `position` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `hire_date` date NULL DEFAULT NULL,
  `salary` decimal(10, 2) NULL DEFAULT NULL,
  `phone_number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`staff_id`) USING BTREE,
  INDEX `name`(`name`) USING BTREE,
  INDEX `gender`(`gender`) USING BTREE,
  INDEX `position`(`position`) USING BTREE,
  INDEX `created_at`(`created_at`) USING BTREE,
  INDEX `last_modified_at`(`last_modified_at`) USING BTREE,
  INDEX `staff_ibfk_1`(`department_id`) USING BTREE,
  INDEX `age`(`age`) USING BTREE,
  INDEX `hire_date`(`hire_date`) USING BTREE,
  INDEX `staff_ibfk_3`(`salary`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of staff
-- ----------------------------
INSERT INTO `staff` VALUES (20100000, '测试', '男', 33, 201, '助理医师', '2017-05-12', 7000.00, '14899270340', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20100001, '测试', '女', 46, 201, '助理医师', '2019-03-08', 8000.00, '16744893201', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120001, '赵宇', '男', 35, 201, '助理医师', '2018-07-10', 6343.00, '13578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120002, '刘鹏', '男', 44, 201, '助理医师', '2019-03-25', 7023.00, '13987654321', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120003, '周雪', '女', 46, 201, '助理医师', '2022-06-28', 5901.00, '15234567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120004, '马婷', '女', 33, 201, '助理医师', '2021-03-20', 7299.00, '15509876543', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120005, '姚晨', '女', 36, 201, '助理医师', '2022-03-17', 5765.00, '15789012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120006, '李杰', '男', 57, 201, '助理医师', '2021-08-02', 5498.00, '17467890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120007, '王娜', '女', 59, 201, '助理医师', '2017-07-27', 6200.00, '17801234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120008, '杨娜', '女', 37, 201, '助理医师', '2023-09-19', 6800.00, '18134567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120009, '赵强', '男', 30, 201, '助理医师', '2019-05-16', 5900.00, '18467890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120010, '陈娜', '女', 31, 201, '助理医师', '2017-06-08', 7888.00, '19023456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120011, '韩兵', '男', 36, 201, '助理医师', '2020-08-21', 7400.00, '19245678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120012, '王梅', '女', 30, 201, '助理医师', '2022-09-13', 5432.00, '19912345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120013, '高磊', '男', 57, 201, '助理医师', '2018-06-29', 6650.00, '13245678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120014, '李晨', '男', 29, 201, '助理医师', '2022-11-02', 7699.00, '13578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120015, '赵梓', '女', 46, 201, '助理医师', '2018-12-10', 7021.00, '15098765432', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120016, '李娜', '女', 33, 201, '助理医师', '2021-11-23', 7899.00, '15509876543', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120017, '刘晨', '女', 37, 201, '助理医师', '2023-04-07', 6789.00, '15789012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120018, '周娜', '女', 59, 201, '助理医师', '2017-08-27', 7120.00, '17801234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120019, '王洁', '女', 45, 201, '助理医师', '2022-03-28', 6900.00, '18245678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120020, '王阳', '男', 53, 201, '助理医师', '2019-10-12', 7799.00, '18790123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120021, '周娟', '女', 34, 201, '助理医师', '2021-12-23', 7899.00, '19023456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120022, '赵晓', '女', 60, 201, '助理医师', '2022-05-17', 7120.00, '19578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120023, '刘婷', '女', 57, 201, '助理医师', '2017-06-23', 6600.00, '13678901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120024, '王萍', '女', 36, 201, '助理医师', '2022-11-16', 6000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120025, '王风', '男', 54, 201, '助理医师', '2018-10-19', 6000.00, '18378901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120026, '刘洁', '女', 35, 201, '助理医师', '2019-06-30', 6000.00, '15301234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120027, '陈晓丽', '女', 57, 201, '助理医师', '2020-09-18', 6000.00, '13445678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120028, '陈梅', '女', 34, 201, '助理医师', '2021-07-31', 6000.00, '18201234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120029, '刘静', '女', 59, 201, '助理医师', '2023-09-28', 6000.00, '15056789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120030, '刘丽', '女', 33, 201, '助理医师', '2023-02-07', 6000.00, '18712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120031, '杨丹', '女', 35, 201, '助理医师', '2021-09-24', 6000.00, '18056789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120032, '张霞', '女', 38, 201, '助理医师', '2020-10-18', 8000.00, '18590123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120033, '周萍', '女', 39, 201, '助理医师', '2020-12-25', 7500.00, '15234567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120034, '李霞', '女', 39, 201, '助理医师', '2020-09-18', 8000.00, '13690123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120035, '周琳', '女', 40, 201, '助理医师', '2020-11-25', 7500.00, '15834567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120036, '张梅', '女', 40, 201, '助理医师', '2020-05-18', 8000.00, '18190123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120037, '周华', '女', 41, 201, '助理医师', '2020-12-25', 7000.00, '15234567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120038, '张琳', '女', 41, 201, '助理医师', '2020-04-18', 8600.00, '13690123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120039, '周勇', '男', 47, 201, '助理医师', '2021-01-25', 7000.00, '15634567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120040, '张华', '女', 41, 201, '助理医师', '2020-03-18', 8000.00, '15190123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120041, '周杰', '男', 48, 201, '助理医师', '2021-02-25', 7000.00, '18934567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120042, '陈明', '男', 42, 201, '助理医师', '2021-09-28', 7500.00, '13689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120043, '王霞', '女', 43, 201, '助理医师', '2019-11-16', 7000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120044, '刘杰', '男', 44, 201, '助理医师', '2019-01-21', 8000.00, '15067890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20120045, '李明', '男', 47, 201, '助理医师', '2018-01-27', 6800.00, '18201234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130001, '陈梦', '女', 42, 201, '主治医师', '2021-09-23', 13987.00, '13612345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130002, '王璐', '女', 38, 201, '主治医师', '2020-11-19', 8221.00, '13856789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130003, '朱浩', '男', 55, 201, '主治医师', '2022-08-23', 12345.00, '15123456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130004, '孙泽', '男', 58, 201, '主治医师', '2022-06-22', 11567.00, '15367890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130005, '魏冰', '女', 53, 201, '主治医师', '2019-04-21', 13000.00, '15890123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130006, '杨林', '男', 45, 201, '主治医师', '2021-02-01', 14234.00, '15901234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130007, '陈涛', '男', 32, 201, '主治医师', '2020-10-26', 8987.00, '17134567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130008, '王晨', '女', 39, 201, '主治医师', '2018-05-18', 12000.00, '17356789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130009, '赵莉', '女', 47, 201, '主治医师', '2019-11-10', 10234.00, '17578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130010, '张飞', '男', 52, 201, '主治医师', '2020-11-03', 10000.00, '17689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130011, '李雨', '女', 40, 201, '主治医师', '2019-09-28', 11056.00, '17912345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130012, '张峰', '男', 54, 201, '主治医师', '2019-08-29', 11678.00, '18245678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130013, '徐丽', '女', 48, 201, '主治医师', '2020-11-12', 13200.00, '18356789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130014, '王露', '女', 41, 201, '主治医师', '2020-12-03', 13876.00, '18578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130015, '刘明', '男', 43, 201, '主治医师', '2019-06-26', 13800.00, '18689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130016, '李云', '女', 55, 201, '主治医师', '2020-06-16', 12100.00, '18801234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130017, '周平', '男', 50, 201, '主治医师', '2021-04-26', 12890.00, '19134567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130018, '刘静', '女', 59, 201, '主治医师', '2021-03-29', 10345.00, '19356789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130019, '王志', '男', 34, 201, '主治医师', '2021-06-11', 12300.00, '19467890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130020, '赵平', '男', 37, 201, '主治医师', '2022-05-10', 11000.00, '19689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130021, '周华', '女', 53, 201, '主治医师', '2018-02-02', 9178.00, '19801234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130022, '李龙', '男', 48, 201, '主治医师', '2018-12-10', 13800.00, '13023456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130023, '刘宇', '男', 44, 201, '主治医师', '2023-01-28', 13900.00, '13134567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130024, '陈杰', '男', 39, 201, '主治医师', '2018-11-04', 10456.00, '13356789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130025, '孙鹏', '男', 33, 201, '主治医师', '2017-10-08', 9856.00, '16678901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130026, '张琦', '女', 38, 201, '主治医师', '2021-08-12', 11800.00, '13612345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130027, '刘阳', '男', 39, 201, '主治医师', '2020-09-15', 12876.00, '13987654321', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130028, '孙伟', '男', 55, 201, '主治医师', '2019-06-16', 14456.00, '15123456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130030, '张磊', '男', 42, 201, '主治医师', '2017-09-04', 12678.00, '15367890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130031, '李飞', '男', 51, 201, '主治医师', '2022-07-18', 15000.00, '15890123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130032, '韩娜', '女', 42, 201, '主治医师', '2018-09-19', 12789.00, '15901234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130033, '程涛', '男', 32, 201, '主治医师', '2019-07-26', 9899.00, '17134567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130034, '朱晨', '女', 35, 201, '主治医师', '2022-04-24', 8900.00, '17356789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130035, '张莉', '女', 49, 201, '主治医师', '2018-11-02', 12900.00, '17578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130036, '刘飞', '男', 44, 201, '主治医师', '2022-12-19', 14876.00, '17689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130037, '王琳', '女', 41, 201, '主治医师', '2020-07-28', 12789.00, '17912345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130038, '张鹏', '男', 39, 201, '主治医师', '2021-09-15', 12600.00, '18134567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130039, '李峰', '男', 47, 201, '主治医师', '2023-05-19', 13678.00, '18578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130040, '张丽', '女', 36, 201, '主治医师', '2022-08-02', 10900.00, '18689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130041, '赵磊', '男', 38, 201, '主治医师', '2017-09-04', 12876.00, '18912345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130042, '李娟', '女', 55, 201, '主治医师', '2018-06-19', 13456.00, '19356789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130043, '张浩', '男', 41, 201, '主治医师', '2019-09-25', 12900.00, '19467890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130044, '李梅', '女', 32, 201, '主治医师', '2019-08-12', 9589.00, '19790123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130045, '陈涛', '男', 35, 201, '主治医师', '2022-07-18', 9899.00, '19912345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130046, '王晨', '男', 33, 201, '主治医师', '2023-07-01', 8900.00, '13901234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130047, '陈飞', '男', 40, 201, '主治医师', '2020-08-31', 12700.00, '13567890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130048, '张杰', '男', 42, 201, '主治医师', '2021-04-05', 12000.00, '13612345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130049, '陈峰', '男', 46, 201, '主治医师', '2020-07-22', 12000.00, '13756789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130050, '张丹', '女', 33, 201, '主治医师', '2021-10-09', 12000.00, '15967890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130051, '赵涛', '男', 37, 201, '主治医师', '2022-08-15', 12000.00, '18190123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130052, '张晓琳', '女', 43, 201, '主治医师', '2017-11-25', 12000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130053, '王浩', '男', 39, 201, '主治医师', '2022-02-03', 12000.00, '15234567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130054, '张峰', '男', 32, 201, '主治医师', '2022-07-23', 12000.00, '18878901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130055, '杨浩', '男', 44, 201, '主治医师', '2018-05-16', 12000.00, '13690123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130056, '李婷', '女', 56, 201, '主治医师', '2018-02-06', 12000.00, '15634567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130057, '赵翔', '男', 41, 201, '主治医师', '2020-04-15', 12000.00, '15845678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130058, '王涛', '男', 31, 201, '主治医师', '2022-05-03', 12000.00, '13589012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130059, '赵浩', '男', 40, 201, '主治医师', '2020-11-28', 12000.00, '15501234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130060, '张梅', '女', 42, 201, '主治医师', '2022-01-31', 15000.00, '18934567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130061, '王磊', '男', 37, 201, '主治医师', '2018-07-12', 15000.00, '13645678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130062, '王伟', '男', 52, 201, '主治医师', '2018-06-22', 8000.00, '13689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130063, '孙强', '男', 55, 201, '主治医师', '2016-08-07', 9000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130064, '陈良', '男', 53, 201, '主治医师', '2019-09-17', 9000.00, '15067890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130065, '王俊', '男', 51, 201, '主治医师', '2018-05-22', 10000.00, '15989012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130066, '孙华', '男', 56, 201, '主治医师', '2016-07-07', 8000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130067, '陈敏', '女', 38, 201, '主治医师', '2019-08-17', 13000.00, '15967890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130068, '李杰', '男', 50, 201, '主治医师', '2015-12-22', 12000.00, '13589012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130069, '孙丹', '女', 57, 201, '主治医师', '2016-06-07', 11000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130070, '陈勇', '男', 50, 201, '主治医师', '2019-11-17', 10000.00, '15067890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130071, '李华', '男', 49, 201, '主治医师', '2015-11-22', 9000.00, '15989012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130072, '孙杰', '男', 58, 201, '主治医师', '2015-07-07', 10000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130073, '陈琳', '女', 39, 201, '主治医师', '2019-12-17', 11000.00, '18367890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130074, '李丹', '女', 45, 201, '主治医师', '2016-10-22', 12000.00, '13589012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130075, '孙平', '男', 59, 201, '主治医师', '2015-08-07', 13000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130076, '陈强', '男', 51, 201, '主治医师', '2019-10-17', 10000.00, '15967890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130077, '杨军', '男', 47, 201, '主治医师', '2020-07-05', 9000.00, '18590123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130078, '杜伟', '男', 51, 201, '主治医师', '2016-12-03', 14000.00, '15234567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20130079, '陈萍', '女', 49, 201, '主治医师', '2017-10-08', 13000.00, '18878901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140001, '王涛', '男', 38, 201, '副主任医师', '2022-06-25', 20000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140002, '张雪', '女', 47, 201, '副主任医师', '2021-12-20', 20000.00, '17878901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140003, '李磊', '男', 58, 201, '副主任医师', '2019-04-20', 20000.00, '13923456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140004, '刘娟', '女', 45, 201, '副主任医师', '2019-08-15', 15000.00, '18278901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140005, '赵丽', '女', 42, 201, '副主任医师', '2019-11-14', 16000.00, '18712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140006, '朱敏', '女', 41, 201, '副主任医师', '2016-06-30', 16000.00, '18156789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140007, '张娟', '女', 48, 201, '副主任医师', '2019-07-15', 15000.00, '18878901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140008, '赵丹', '女', 43, 201, '副主任医师', '2019-10-14', 17000.00, '13712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140009, '朱勇', '男', 54, 201, '副主任医师', '2016-05-30', 19000.00, '13756789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140010, '王平', '女', 47, 201, '副主任医师', '2017-04-15', 20000.00, '18378901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140011, '赵勇', '男', 44, 201, '副主任医师', '2019-09-14', 21000.00, '18712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140012, '朱强', '男', 55, 201, '副主任医师', '2016-04-30', 18000.00, '18156789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140013, '王丹', '女', 46, 201, '副主任医师', '2017-05-15', 15000.00, '18878901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140014, '赵平', '女', 44, 201, '副主任医师', '2019-08-14', 21000.00, '15712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140015, '朱华', '女', 42, 201, '副主任医师', '2016-03-30', 22000.00, '15056789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140016, '王强', '男', 52, 201, '副主任医师', '2018-04-15', 16000.00, '17878901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140017, '赵强', '男', 45, 201, '副主任医师', '2019-07-14', 18000.00, '18712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140018, '朱琳', '女', 43, 201, '副主任医师', '2016-02-28', 17000.00, '18056789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140019, '王娟', '女', 39, 201, '副主任医师', '2022-06-12', 19000.00, '18278901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140020, '张勇', '男', 46, 201, '副主任医师', '2017-02-08', 23000.00, '18712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140021, '赵敏', '女', 38, 201, '副主任医师', '2022-08-19', 25000.00, '13445678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140022, '王艳', '女', 41, 201, '副主任医师', '2020-05-11', 17000.00, '13690123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140023, '张阳', '男', 50, 201, '副主任医师', '2022-06-17', 22456.00, '13798765432', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140024, '高伟', '男', 49, 201, '副主任医师', '2017-03-04', 19876.00, '15678901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140025, '刘芳', '女', 51, 201, '副主任医师', '2022-01-28', 18900.00, '17245678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140026, '刘冬', '男', 56, 201, '副主任医师', '2021-05-28', 21678.00, '18023456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140027, '张禹', '男', 47, 201, '副主任医师', '2023-12-05', 19998.00, '18912345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140028, '张洋', '女', 45, 201, '副主任医师', '2023-03-24', 16789.00, '19790123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140029, '王斌', '男', 43, 201, '副主任医师', '2023-05-19', 17987.00, '13798765432', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140030, '宋雪', '女', 50, 201, '副主任医师', '2022-02-08', 20333.00, '15234567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140031, '吴芳', '女', 47, 201, '副主任医师', '2020-05-30', 17200.00, '17245678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140032, '杨静', '女', 56, 201, '副主任医师', '2019-05-14', 19600.00, '18023456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140033, '陈晨', '女', 31, 201, '副主任医师', '2018-12-10', 12987.00, '18467890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140034, '刘磊', '男', 37, 201, '副主任医师', '2023-03-09', 8700.00, '19245678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140035, '孙静', '女', 48, 201, '副主任医师', '2020-05-30', 18300.00, '19689012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140036, '张婷', '女', 46, 201, '副主任医师', '2018-09-19', 17289.00, '13789012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140037, '杨静', '女', 29, 201, '副主任医师', '2019-12-13', 20000.00, '15045678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140038, '杨飞', '男', 50, 201, '副主任医师', '2021-08-12', 20000.00, '18712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20140039, '李萍', '女', 48, 201, '副主任医师', '2018-04-11', 20000.00, '15067890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150001, '李秋', '女', 31, 201, '主任医师', '2017-05-06', 37890.00, '15098765432', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150002, '周琳', '女', 60, 201, '主任医师', '2022-09-07', 31000.00, '17023456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150003, '邓伟', '男', 34, 201, '主任医师', '2019-09-25', 42000.00, '17790123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150004, '王健', '男', 38, 201, '主任医师', '2020-12-06', 31999.00, '18790123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150005, '李婷', '女', 52, 201, '主任医师', '2019-10-03', 45678.00, '19578901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150006, '张琳', '女', 56, 201, '主任医师', '2023-01-23', 37700.00, '13467890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150007, '陈雨', '女', 31, 201, '主任医师', '2022-03-28', 32890.00, '13856789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150008, '周翔', '男', 48, 201, '主任医师', '2020-02-13', 28789.00, '15678901234', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150009, '王浩', '男', 60, 201, '主任医师', '2023-06-08', 42600.00, '17023456789', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150010, '陈峰', '男', 59, 201, '主任医师', '2020-01-05', 36500.00, '17467890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150011, '李旭', '男', 34, 201, '主任医师', '2023-10-31', 42000.00, '17790123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150012, '刘涛', '男', 52, 201, '主任医师', '2020-10-04', 26890.00, '18356789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150013, '杨晨', '女', 43, 201, '主任医师', '2021-06-24', 29789.00, '18801234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150014, '王飞', '男', 49, 201, '主任医师', '2020-02-13', 27689.00, '19134567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150015, '王翔', '男', 54, 201, '主任医师', '2018-11-24', 29600.00, '19801234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150016, '杨磊', '男', 58, 201, '主任医师', '2020-05-08', 32600.00, '13856789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150017, '李静', '女', 56, 201, '主任医师', '2022-02-22', 28800.00, '13456789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150018, '刘飞', '男', 51, 201, '主任医师', '2023-01-28', 35000.00, '15834567890', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150019, '李雪', '女', 42, 201, '主任医师', '2023-03-04', 35000.00, '13589012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150020, '刘鹏', '男', 30, 201, '主任医师', '2023-12-01', 35000.00, '18156789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150021, '王丽丽', '女', 55, 201, '主任医师', '2021-01-05', 35000.00, '15989012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150022, '张翔', '男', 49, 201, '主任医师', '2019-09-11', 35000.00, '15712345678', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150023, '陈浩', '男', 36, 201, '主任医师', '2019-03-09', 35000.00, '18367890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150024, '杨丽', '女', 53, 201, '主任医师', '2017-08-15', 35000.00, '15190123456', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150025, '陈风', '男', 50, 201, '主任医师', '2020-11-03', 35000.00, '15967890123', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150026, '李健', '男', 48, 201, '主任医师', '2017-04-29', 40000.00, '15601234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150027, '吴勇', '男', 47, 201, '主任医师', '2018-10-12', 41000.00, '13445678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150028, '刘健', '男', 49, 201, '主任医师', '2017-03-29', 40000.00, '18201234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150029, '吴强', '男', 48, 201, '主任医师', '2018-09-12', 41000.00, '15045678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150030, '刘洋', '男', 50, 201, '主任医师', '2017-01-29', 40000.00, '15301234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150031, '吴琳', '女', 49, 201, '主任医师', '2018-08-12', 41000.00, '13445678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150032, '刘强', '男', 51, 201, '主任医师', '2016-12-29', 40000.00, '18201234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150033, '吴丹', '女', 50, 201, '主任医师', '2018-07-12', 41000.00, '15845678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150034, '刘琳', '女', 50, 201, '主任医师', '2016-11-29', 40000.00, '15501234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150035, '吴华', '女', 51, 201, '主任医师', '2018-06-12', 41000.00, '13645678901', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150036, '刘燕', '女', 53, 201, '主任医师', '2018-03-21', 41000.00, '15601234567', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150037, '孙慧', '女', 40, 201, '主任医师', '2021-04-05', 40000.00, '18156789012', '2023-12-01 23:53:00', '2023-12-01 23:53:00');
INSERT INTO `staff` VALUES (20150038, '张飞', '男', 56, 201, '主任医师', '2015-09-24', 42000.00, '15989012345', '2023-12-01 23:53:00', '2023-12-01 23:53:00');

-- ----------------------------
-- Table structure for surgeries
-- ----------------------------
DROP TABLE IF EXISTS `surgeries`;
CREATE TABLE `surgeries`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `doctor_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `doctor_id` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `patient_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `surgery_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `surgery_date` date NULL DEFAULT NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_modified_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 21 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of surgeries
-- ----------------------------
INSERT INTO `surgeries` VALUES (1, '李雪', '20150019', '俞功羿', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (2, '刘鹏', '20150020', '虞鸽艾', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (3, '王丽丽', '20150021', '虞或令', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (4, '张翔', '20150022', '袁言纯', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (5, '陈浩', '20150023', '云菁亚', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (6, '杨丽', '20150024', '詹眉咪', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (7, '陈风', '20150025', '张飙逸', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (8, '李健', '20150026', '张银杉', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (9, '吴勇', '20150027', '郑洁昕', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (10, '刘健', '20150028', '郑牧柏', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (11, '吴强', '20150029', '郑念秋', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (12, '刘洋', '20150030', '仲晨品', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (13, '吴琳', '20150031', '周珉君', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (14, '刘强', '20150032', '周游海', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (15, '吴丹', '20150033', '周玥虹', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (16, '刘琳', '20150034', '朱忱其', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (17, '吴华', '20150035', '祝楚峥', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (18, '刘燕', '20150036', '祝琴意', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (19, '孙慧', '20150037', '宗昶铎', NULL, NULL, NULL, NULL);
INSERT INTO `surgeries` VALUES (20, '张飞', '20150038', '宗玺登', NULL, NULL, NULL, NULL);

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users`  (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `gender` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `phone_number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `identity` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `job_number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `created_at` datetime NULL DEFAULT NULL,
  `last_login_at` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES (1, 'test', '123', '男', '19972846109@qq.com', '19422094781', '管理员', '50130001', '2023-11-24 08:15:31', '2023-12-26 15:35:03');
INSERT INTO `users` VALUES (2, 'demo', '123', '女', '1745912560@qq.com', '16745721945', '普通用户', '', '2023-12-26 10:27:33', '2023-12-26 15:29:08');

SET FOREIGN_KEY_CHECKS = 1;
